
# Task 2 Вести з консолі строку зі слів (або скористайтеся константою).
# Напишіть код, який визначить кількість слів, в цих даних.

# test = input("Введіть набір слів: ")
# result = test.split(" ")
#
# if test.isspace():
#     print("Поле не повинно бути пустим!!!")
# else:
#     print(len(result))



# Task 3 Існує ліст з різними даними, наприклад
# lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum'].
# Напишіть механізм, який сформує новий list (наприклад lst2), який би містив всі числові змінні, які є в lst1.
# Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.

lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
lst2 = lst1.copy()

for i in lst1:
    if type(i) != int:
        lst2.remove(i)
print(f"List #2: {lst2}")
print(lst1)
