from Homework6 import movie_viewer
import pytest


@pytest.mark.parametrize("firstly, exp_result", [("1", "Тобі ж 1 рік! Де твої батьки?\n"),
                                                 ("2", "Тобі ж 2 роки! Де твої батьки?\n"),
                                                 ("3", "Тобі ж 3 роки! Де твої батьки?\n"),
                                                 ("4", "Тобі ж 4 роки! Де твої батьки?\n"),
                                                 ("5", "Тобі ж 5 років! Де твої батьки?\n"),
                                                 ("6", "Тобі ж 6 років! Де твої батьки?\n"),
                                                 ("7", "Тобі лише 7 років, а це є фільм для дорослих!\n"),
                                                 ("8", "Тобі лише 8 років, а це є фільм для дорослих!\n"),
                                                 ("9", "Тобі лише 9 років, а це є фільм для дорослих!\n"),
                                                 ("10", "Тобі лише 10 років, а це є фільм для дорослих!\n"),
                                                 ("11", "О, вам 11 років! Який цікавий вік!\n"),
                                                 ("12", "Тобі лише 12 років, а це є фільм для дорослих!\n"),
                                                 ("13", "Тобі лише 13 років, а це є фільм для дорослих!\n"),
                                                 ("14", "Тобі лише 14 років, а це є фільм для дорослих!\n"),
                                                 ("15", "Тобі лише 15 років, а це є фільм для дорослих!\n"),
                                                 ("16", "Незважаючи на те, що вам 16 років, білетів всеодно нема!\n"),
                                                 ("17", "Незважаючи на те, що вам 17 років, білетів всеодно нема!\n"),
                                                 ("18", "Незважаючи на те, що вам 18 років, білетів всеодно нема!\n"),
                                                 ("19", "Незважаючи на те, що вам 19 років, білетів всеодно нема!\n"),
                                                 ("20", "Незважаючи на те, що вам 20 років, білетів всеодно нема!\n"),
                                                 ("21", "Незважаючи на те, що вам 21 рік, білетів всеодно нема!\n"),
                                                 ("22", "О, вам 22 роки! Який цікавий вік!\n"),
                                                 ("23", "Незважаючи на те, що вам 23 роки, білетів всеодно нема!\n"),
                                                 ("24", "Незважаючи на те, що вам 24 роки, білетів всеодно нема!\n"),
                                                 ("25", "Незважаючи на те, що вам 25 років, білетів всеодно нема!\n"),
                                                 ("26", "Незважаючи на те, що вам 26 років, білетів всеодно нема!\n"),
                                                 ("27", "Незважаючи на те, що вам 27 років, білетів всеодно нема!\n"),
                                                 ("28", "Незважаючи на те, що вам 28 років, білетів всеодно нема!\n"),
                                                 ("29", "Незважаючи на те, що вам 29 років, білетів всеодно нема!\n"),
                                                 ("30", "Незважаючи на те, що вам 30 років, білетів всеодно нема!\n"),
                                                 ("66", "О, вам 66 років! Який цікавий вік!\n"),
                                                 ("3213", "Вам 3213 років? Покажіть пенсійне посвідчення!\n"),
                                                 ("0", "Вік не повинен починатись з 0!!!\n"),
                                                 ("002321", "Вік не повинен починатись з 0!!!\n"),
                                                 ("dsa", "Поле повинно містити тільки цифри!\n"),
                                                 (" ", "Поле повинно містити тільки цифри!\n"),
                                                 ("-321", "Поле повинно містити тільки цифри!\n"),
                                                 ("&^&%", "Поле повинно містити тільки цифри!\n"),
                                                 ("321 3", "Поле повинно містити тільки цифри!\n"),
                                                 ("+22", "Поле повинно містити тільки цифри!\n")])
def test_year_options(firstly, exp_result, capsys):
    movie_viewer(firstly)
    assert capsys.readouterr().out == exp_result

